In [1]:
import pandas as pd

In [3]:
df = pd.read_csv("02preprocesamiento\chapter3\data_studentlist.csv")

<>:1: SyntaxWarning: invalid escape sequence '\c'
<>:1: SyntaxWarning: invalid escape sequence '\c'
C:\Users\felip\AppData\Local\Temp\ipykernel_2456\1022346825.py:1: SyntaxWarning: invalid escape sequence '\c'
  df = pd.read_csv("02preprocesamiento\chapter3\data_studentlist.csv")

In [6]:
df.head()

              name gender  age  grade absence bloodtype  height  weight
0    Jared Diamond      M   23      3       Y         O   165.3    68.2
1   Sarah O'Donnel      F   22      2       N        AB   170.1    53.0
2     Brian Martin      M   24      4       N         B   175.0    80.1
3     David Hassel      M   23      3       N        AB   182.1    85.7
4  Clara Rodriquez      F   20      1       Y         A   168.0    49.5

In [7]:
df.groupby(["gender","bloodtype"])["height"].mean()

gender  bloodtype
F       A            172.450000
        AB           170.100000
        B            158.200000
        O            164.433333
M       A            165.700000
        AB           181.050000
        B            174.550000
        O            166.200000
Name: height, dtype: float64

In [56]:
my_dict = {"Size": ["L", "L", "M", "M", "M", "S", "S", "S", "S"],
           "Type": ["A", "A", "A", "B", "B", "A", "A", "B", "B"],
           "Location": ["L1", "L1", "L1", "L2", "L2", "L1", "L2", "L2", "L1"],
           "A": [1, 2, 2, 3,3, 4, 5, 6, 7],
           "B": [2, 4, 5, 5, 6, 6, 8, 9, 9]}

df = pd.DataFrame(my_dict)
df

  Size Type Location  A  B
0    L    A       L1  1  2
1    L    A       L1  2  4
2    M    A       L1  2  5
3    M    B       L2  3  5
4    M    B       L2  3  6
5    S    A       L1  4  6
6    S    A       L2  5  8
7    S    B       L2  6  9
8    S    B       L1  7  9

In [ ]:
dfr = pd.pivot_table(df, index=['Size', 'Type'], columns='Location', values='B')
dfr

Location    L1   L2
Size Type
L    A     3.0  NaN
M    A     5.0  NaN
     B     NaN  5.5
S    A     6.0  8.0
     B     9.0  9.0

In [15]:
dfr.columns

Index(['L1', 'L2'], dtype='object', name='Location')

In [16]:
dfr.index

MultiIndex([('L', 'A'),
            ('M', 'A'),
            ('M', 'B'),
            ('S', 'A'),
            ('S', 'B')],
           names=['Size', 'Type'])

In [17]:
pd.pivot_table(df, index=['Size', 'Type'], columns='Location', values='B', fill_value=0)

Location    L1   L2
Size Type
L    A     3.0  0.0
M    A     5.0  0.0
     B     0.0  5.5
S    A     6.0  8.0
     B     9.0  9.0

In [61]:
import numpy as np
pd.pivot_table(df, index=['Size', 'Type'], columns='Location', values='B', aggfunc=np.mean, fill_value=0)

C:\Users\felip\AppData\Local\Temp\ipykernel_2456\2096512660.py:2: FutureWarning: The provided callable <function mean at 0x0000019A2F002D40> is currently using DataFrameGroupBy.mean. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "mean" instead.
  pd.pivot_table(df, index=['Size', 'Type'], columns='Location', values='B', aggfunc=np.mean, fill_value=0)

Location    L1   L2
Size Type
L    A     3.0  0.0
M    A     5.0  0.0
     B     0.0  5.5
S    A     6.0  8.0
     B     9.0  9.0

In [64]:
dfr = pd.pivot_table(df, index='Location', columns=['Size', 'Type'], values='B', fill_value=0)
dfr

Size        L    M         S
Type        A    A    B    A    B
Location
L1        3.0  5.0  0.0  6.0  9.0
L2        0.0  0.0  5.5  8.0  9.0

In [22]:
dfr.index

Index(['L1', 'L2'], dtype='object', name='Location')

In [23]:
dfr.columns

MultiIndex([('L', 'A'),
            ('M', 'A'),
            ('M', 'B'),
            ('S', 'A'),
            ('S', 'B')],
           names=['Size', 'Type'])

In [ ]:

pd.pivot_table(df, index=['Size', 'Type'], columns='Location', values='B', aggfunc=np.import seaborn as sb, fill_value=0)

SyntaxError: invalid syntax (2132079199.py, line 1)

In [ ]:
import seaborn as sns

In [25]:
pd.pivot_table(df, index=['Size', 'Type'], values=['A', 'B'], aggfunc=np.mean)

C:\Users\felip\AppData\Local\Temp\ipykernel_2456\3323099325.py:1: FutureWarning: The provided callable <function mean at 0x0000019A2F002D40> is currently using DataFrameGroupBy.mean. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "mean" instead.
  pd.pivot_table(df, index=['Size', 'Type'], values=['A', 'B'], aggfunc=np.mean)

             A    B
Size Type
L    A     1.5  3.0
M    A     2.0  5.0
     B     3.0  5.5
S    A     4.5  7.0
     B     6.5  9.0

In [26]:
df.groupby(['Size', 'Type'])[['A', 'B']].mean()

             A    B
Size Type
L    A     1.5  3.0
M    A     2.0  5.0
     B     3.0  5.5
S    A     4.5  7.0
     B     6.5  9.0

In [49]:
df= pd.pivot_table(df, index=['Size', 'Type'], values=['A', 'B'], aggfunc={'A': np.max, 'B': np.min})

C:\Users\felip\AppData\Local\Temp\ipykernel_2456\3918869997.py:1: FutureWarning: The provided callable <function max at 0x0000019A2F002340> is currently using SeriesGroupBy.max. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "max" instead.
  df= pd.pivot_table(df, index=['Size', 'Type'], values=['A', 'B'], aggfunc={'A': np.max, 'B': np.min})
C:\Users\felip\AppData\Local\Temp\ipykernel_2456\3918869997.py:1: FutureWarning: The provided callable <function min at 0x0000019A2F002480> is currently using SeriesGroupBy.min. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "min" instead.
  df= pd.pivot_table(df, index=['Size', 'Type'], values=['A', 'B'], aggfunc={'A': np.max, 'B': np.min})

In [50]:
df.sum(axis=0)
df.sum(axis=1)
df.mean(axis=0, skipna=False)
df.describe()
df.count(axis=0)
df.A.corr(df.B)
df.corr()
df.corrwith(df.A)

A    1.000000
B    0.891297
dtype: float64

In [51]:
df.isnull()
(df.isnull()).sum(axis=0)
(df.isnull()).mean(axis=0)
df.dropna(axis=0)
df.dropna(axis=1)
df.dropna(axis=0, thresh=3)
df.fillna(value=0)

           A  B
Size Type
L    A     2  2
M    A     2  5
     B     3  5
S    A     5  6
     B     7  9